import 'package:dinbil/model/question_model.dart';

List<QuestionModel> questions2 = [
  QuestionModel("Бүт ааламга ырыскы берүүчү Аллахтын кайсы ысымы?", {
    " Раззак ": true,
    "Ар-Рахман": false,
    "Аль-Маалик": false,
    "Аль-Куддус": false,
  }),
  QuestionModel("Кит жутуп алган пайгамбар?", {
    "Сулайман": false,
    "Даут": false,
    " Муса": false,
    "Юнус": true,
  }),
  QuestionModel("Сулуу жүздүү пайгамбар?", {
    "Жусуп а.с)": true,
    "Иса а.с": false,
    "Мухаммад с.а.в": false,
    "Адам а.с.": false,
  }),
  QuestionModel("Жаныбар тилин билген пайгамбар?", {
    "Айюб": false,
    "Ясья": false,
    " Сулайман ": true,
    "Харун": false,
  }),
  QuestionModel("Курани Каррим канча жылда түшкөн?", {
    "100": false,
    "59": false,
    "49": false,
    "23": true,
  }),
  QuestionModel("Курани Каримде канча аят бар?", {
    "6666 ": true,
    "6000": false,
    "1000": false,
    "белгисиз": false,
  }),
  QuestionModel("Курани Карим кимге түшурулгөн?", {
    "Пайгамбарыбыз с.а.в. ": false,
    "Адам а.с.га": false,
    "Пайгамбарларга": true,
    "Дүйнө жузүнө": false,
  }),
  QuestionModel(
      "Пайгамбарыбыз с.а.в. каза болгондо Айша энебиз канча жашта эле?", {
    "34": false,
    "27": true,
    "40": false,
    "45": false,
  }),
  QuestionModel("Азирети Айша энебиз канча хадис риваят кылган?", {
    "1566": false,
    "2578": false,
    "3000": false,
    "2210": true,
  }),
  QuestionModel("Бейиштеги дарыя?", {
    "Тасним": false,
    "Зам зам ": false,
    "Каусар ": true,
    "Дарыя жок": false,
  }),
  QuestionModel("Курандын сыры кайсы сурөөдө жашырылган?", {
    "Фатиха": true,
    "Ихлас": false,
    " Мүлк": false,
    "Бакара": false,
  }),
  QuestionModel("Фатиха сүрөөсү фарз намаздарда канча жолу окулат?", {
    "10": false,
    "16": false,
    "17 ": true,
    "18": false,
  }),
  QuestionModel(
      "Азирети Айша энебиз Ислам динин кабыл алганда канча жашта болчу?", {
    "4-5 жашында a)": true,
    "7-9 жашында": false,
    "15-18 жашында": false,
    "10-12 жашында": false,
  }),
  QuestionModel(
      " Алланын элчиси дүйнө салгандан кийин азирети Абу Бакр болжолдуу канча жыл халифалык кылган?",
      {
        "10 жыл 3 ай 10 күн ": false,
        "1 жыл 1 ай 10 күн": false,
        "2  жыл 3 ай 10 күн": true,
        "5 жыл 5  ай 25 күн": false,
      }),
  QuestionModel("Азирети Абу Бакр  канча жашында дүйнө салган?", {
    "34": false,
    "63 ": true,
    "45": false,
    "70": false,
  }),
  QuestionModel("Абу Бакр р.а.нун жаназасын ким окуган?", {
    "Усман р.а.": false,
    "Умар р.а. ": true,
    "Билал р.а.": false,
    "Али р.а.": false,
  }),
  QuestionModel("Эң көп жыл даават кылган пайгамбар?", {
    "Юсуф": false,
    "Даут": false,
    "Муса ": false,
    "Нух": true,
  }),
  QuestionModel("Умар р.а.нун кызынын аты ким?", {
    "Сафия": false,
    "Хафса ": true,
    "Аиша": false,
    "Асма ": false,
  }),
  QuestionModel(
      "Шайтан адамдарды азгыруу үчүн канча убакыт өлбөй жашоону суранган?", {
    "100 кылым": false,
    "Күндө суранат": false,
    "Кыяматка чейин ": true,
    "100 жыл": false,
  }),
  QuestionModel("Ислам дининде канча шарт бар?", {
    "9": false,
    "6": false,
    "3": false,
    "5 ": true,
  }),
  QuestionModel("Эң бай пайгамбар ким болгон?", {
    "Сулайман а.с": true,
    "Идрис а.с. ": false,
    "Пайгамбарыбыз с.а.в.": false,
    "Иса а.с.": false,
  }),
  QuestionModel("Фатиха сүрөөсү канча аяттан турат?", {
    "5": false,
    "7": true,
    "12": false,
    "3": false,
  }),
  QuestionModel("Адам а.с. жуманын кайсы күнү жаратылган?", {
    "Дүйшөнбү": false,
    "Ишенби": false,
    "Жаратылган эмес": false,
    "Жума": true,
  }),
  QuestionModel("Азирети Хадича энебиз Пайгамбарыбыз с.а.в.га ким болгон?", {
    "Чоң апасы": false,
    "Апасы": false,
    "Жубайы": true,
    "Тууганы": false,
  }),
  QuestionModel("Пайгамбарыбыз с.а.в. га алгачкы аят кайсыл жерде түшкөн?", {
    "Хира үнкүрүндө ": true,
    "Сара тоосунда": false,
    "Меккеде": false,
    "Каабада": false,
  }),
  QuestionModel("Мухаммад с.а.в. көккө көтөрүлгөн түн? ", {
    "Мираж": true,
    "Бараат": false,
    "Жума": false,
    "Акса": false,
  }),
  QuestionModel(
      " Шариятта эркектерге кандай кездемеден тигилген кийим арам кылынган?", {
    "Баркыт": false,
    "Жибек": true,
    "Баары боло берет": false,
    " Хб": false,
  }),
  QuestionModel("Муса пайгамбарга кайсы китеп түшкөн?", {
    "Инжил": false,
    "Забур": false,
    "Тоорат": true,
    "Куран": false,
  }),
  QuestionModel("Иса пайгамбардын сахабалары ким деп аталат?", {
    "Ансарлар": false,
    "Мухажирлер": false,
    " Курайштар": false,
    " Хаварийлер ": true,
  }),
  QuestionModel(" Курайштар", {
    "Жума намаз ": true,
    "Багымдат": false,
    "Куптан": false,
    "Орозо күндөгү намаз": false,
  }),
  QuestionModel("Куранда 'бисмиллаах' менен башталбаган сүрөө?", {
    "Бакара ": false,
    "Ясин": false,
    "Тообо ": true,
    "Мүлк": false,
  }),
  QuestionModel("Кайсы жаныбардын өзү жана денеси нажас болуп саналат?", {
    "Мышык": false,
    "Чочко ": true,
    "Ит": false,
    "Эшек": false,
  }),
  QuestionModel("Кыш мезгили Курани Каримде эскертилгенбе?", {
    "Жок": false,
    "Ооба": true,
    "Билгим келет": false,
    "Көп эле жолу": false,
  }),
  QuestionModel(
      "Пайгамбарыбыз с.а.в. Жабраил периштени өз келбетинде канча жолу көргөн?",
      {
        "3": false,
        "1": false,
        "4": false,
        "2": true,
      }),
  QuestionModel("Хадисте Жабраил периштенин канча канаты бар деп келген?", {
    "77": false,
    "600": true,
    "100": false,
    "20": false,
  }),
  QuestionModel("Дүйнөдө эң илимдүү ким болгон?", {
    "Хызыр а.с.": true,
    "Жиндер": false,
    "Периштелер": false,
    "Муса а.с.": false,
  }),
  QuestionModel("Али р.а.нун атасынын аты ким?", {
    "Саъад": false,
    "Абу Лахаб": false,
    "Абу Талиб ": true,
    "Абдул Мутталиб": false,
  }),
  QuestionModel(" Аллахтын элчисине кайсыл жер эң сүйкүмдүү болгон?", {
    "Мадина": false,
    "Акса мечити": false,
    "Табук": false,
    "Мекке": true,
  }),
  QuestionModel(
    "Курани Каримде 'Алланын досу' деп кайсы пайгамбар аталган?",
    {
      "Муса а.с.": false,
      "Ибрахим а.с. ": true,
      "Лут а.с.": false,
      "Якуб а.с.": false,
    },
  ),
  QuestionModel("Ибрахим а.с. кайсы шаарда төрөлгөн?", {
    "Медина": false,
    "Израил": false,
    "Бабыл ": true,
    "Билгим келет": false,
  }),
  QuestionModel("Ибрахим а.с. кайсы шаарда чоңойгон?", {
    "Харран": true,
    "Медина": false,
    "Израил": false,
    "Бабыл": false,
  }),
  QuestionModel("Харранганын эли кимге сыйынышчуу?", {
    "Жылдыздарга": false,
    "Планеталарга": false,
    "Баары туура ": true,
    "Таштан жасалган буттарга": false,
  }),
  QuestionModel("Ибрахим а.с. атасынын аты?", {
    "Сара": false,
    "Ажар": false,
    "Муса": false,
    "Азар": true,
  }),
  QuestionModel("Азар кандай адам эле?", {
    "Такыба": false,
    "Илимдүү": false,
    "Мушрик": true,
    "Ач көз": false,
  }),
  QuestionModel("Мушрик деген эмне?", {
    "Такыба адам": false,
    "Саран адам": false,
    "Илимдүү адам": false,
    "Динден адашкан адам ": true,
  }),
  QuestionModel(
      "Ибрахим а.с.атасын динге чакырганда атасы кандай чечим чыгарган?", {
    "Аллах жолуна түшкөн": false,
    "Унчукпай койгон": false,
    "Буттарга сыйынууну токтоткон эмес ": true,
    "Билгим келет": false,
  }),
  QuestionModel("Атасы динден баш тартканда Ибрахим а.с. эмне кылды?", {
    "Атасына дуба кылды": false,
    "Насаат сөзүн айтты": false,
    "Үйдөн чыгып кетти": false,
    "Баары туура ": true,
  }),
  QuestionModel(
      "Ибрахим а.с. таштарды майдалап салганда мушриктер эмне кылабыз деп чечишкен?",
      {
        "Балыктарга жем кылып берүүнү": false,
        "Сууга ыргытууну": false,
        "Аесуз кыйноону": false,
        "Чоң отко өрттөп жиберүүнү ": true,
      }),
  QuestionModel("Аялды сүйүү ____________.", {
    "Важип": false,
    "Парз": false,
    "Күнөө": false,
    "Суннөт": true,
  }),
  QuestionModel("Аялды кубандыруу, көңүлүн алуу ж.б.________.", {
    "Сооп": true,
    "Сүннөт": false,
    "Важип": false,
    "Парз ": false,
  }),
];
