import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class TheFourteenthPage extends StatelessWidget {
  const TheFourteenthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «СӨЗДӨ СЫЙКЫР БАР»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/image.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Оболу мен сиздерге бир суроо салайын, окурман. Азыркы күндө сөз күчтүүбү же акчабы? Бул суроого ар ким ар кандай жооп бериши мүмкүн. Кай бири акча десе, кай бири сөз деп айтышар. Мен бул суроонун сөз күчтүү дегенине кошулар элем. Себеби, жылуу сөз менен жыланды ийинден чыгарып, тоң моюнду жумшартып, оорулууну сакайтып, бир айылды экиге бөлүп, эки айылды бир түндүккө бириктирсе болот. Ата-бабаларыбыз кара сөздү жорго сымал жорголотуп, топчудай сөзгө, тоодой маанини камтып, кара кылды как жарып, дил түзөлсө, тил түзөлөт, тил түзөлсө сөз түзөлөт деп ар бир сөзүнө абай салып,артынан элди ээрчите билген. Азыркы күндө оюбузга эмне келсе ошону балп этире айта салып, көпчүлүк кезде бармак тиштеп олтурган күнүбүз жок эмес. Кээде ошол сөзүбүз жашообузга жарака берип, тагдырыбыздын талкаланышына себеп болууда. Анткени сөздө, биз билбеген күчтүү энергия бар. Азирети пайгамбарыбыз Мухаммеддин (САВ) “Сөздө сыйкыр бар”, – деген маанидеги хадиси бар. Ооба!  Сөздө сыйкыр бар. Бирок кандай сөздө? Жүрөктөн чыккан сөздө деп ойлойм. Кээде бир адамга жакшылык жасап батасын алсаң, жан дүйнөң балкып, жашооң жакшырганын байкайсың. Ошол эле маалда бирөөнү сыздатып, каргышына калган адамдын жыргаганын көрбөйсүң. Эми карасаңыз, бир эле ооздон чыккан сөз адамдын жашоосун астын-үстүн кылат. Кээде ооруп доктурга барсаң доктурдун, “Сенде баары жакшы, эч сарсанаа болбо”, – деген сөзү ооруп жаткан жериңди унуттуруп салат. Ошол эле маалда доктурдун капалуу сөзү ооруңа оору кошуп, өмүрүңө сур булутту сүрүп келет. Мынча болду Пайгамбарлардын тарых-таржымалына токтоло  кетейинчи. Ар бир Пайгамбарга Алла Таала тарабынан бир мужиза берилген. Мисалы, Иса пайгамбарга табыпчылык. Иса алейхисалам өлгөн адамды тирилте алган. Муса пайгамбарга сыйкырчылык. Деңизди экиге бөлүп, таягын жылан кылган. Ал эми сүйүктүү пайгамбарыбыз Мухаммедге (САВ) көптөгөн мужижалар берилсе, ошонун ичинен эң күчтүүсү СӨЗ болуп саналат. Себеби, ошол доордо сөздүүлөр эл алды болуп, сөзү менен элдин өздөрүнө каратып келген. Керек болсо Пайгамбарыбызды сыйкырчы, анын сөзү арбап алат, аны менен сүйлөшпөгүлө деген чакырыктар көп болгон. Пайгамбарыбыздын сөзүн уккан адам эч качан башка сөздү муюп угушкан эмес. Пайгамбарыбыздын оозу менен Ыйык Куран жана улуу сөздөр Алла Таала тарабынан айтылып турган. Пайгамбарыбыздын байлыгы, бийлиги болгон эмес. Анын өзүнө жарашкан сөзү, сөзүнө жарашкан Өзү болгон. Пайгамбарыбыз артына алтын, күмүш калтырган жок. Бирок артына ыйык Куранды жана сүннөт-хадисин калтырды. Ал экөө тең сөздөн турат. Демек, акыркы пайгамбар Мухаммед (САВ) болсо, кыяматка чейин анын айткан сөзү жыл жаңырып жашай берет. Кечээги салынган имарат эртен кулашы мүмкүн, бирок Пайгамбарымдын сөзү эч качан эскирбейт жана өчпөйт. Пайгамбарыбыз айтты: “Сүйлөсөң жакшы сүйлө, болбосо унчукпа”. Урматтуу окурманым! Кай жерде болбойлу сүйлөөр сөзүбүздү жети өлчөп, бир кесип сүйлөйлү. Себеби биздин сөз, биздин эртеңки жашообуз, эртеңки аброюбуз. “Тилден кыйын доо жок, тилден кыйын жоо жок” – деп айтылат. “Кылычынан кан тамганды, тилинен бал тамган жеңген” экен. “Бир сөз көңүл даарылайт, бир сөз көңүл жаралайт”, –деп бекеринен айтылган эмес. Эрнис Уметов',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
