import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class FirstPage extends StatelessWidget {
  const FirstPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(left: 15, top: 20, right: 10),
            child: Column(
              children: [
                const Center(
                  child: Text('ЭЧ КАЧАН АЛЛАХТЫН ЫРАЙЫМЫНАН ҮМҮТ ҮЗБӨ',
                      textAlign: TextAlign.center,
                      style: QuestionModel.firttext),
                ),
                Image.asset(
                  'assets/1.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 10,
                ),
                const Text(
                    '     Эх, менин оорукчан бир тууганым, сенин даражаң Аллах алдында канчалык жогору экенин билгениңде, балким кайгырбай шүгүр кылып жашоодо өзүңдү керексиз бечара төмөн инсанмын дебей, жакшылыктан үмүт кылып, алдыга гана умтулуп жашамаксың. Аллах Тааламдын оорукчан пендесин эң жакшы көрөрүн, ал үчүн берген ооруу сыноосу азапталышы үчүн эмес, күнөөлөрү төгүлүп ырайымына бөлөнүп, бейишине ыраа көргөнүн төмөнкү хадистерден байкасак болот.',
                    style: QuestionModel.textStyle),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                    '     Пайгамбарыбыз (саллаллоху алайхи ва саллам) мындай дейт:\n«Пенде ооруп калганда Аллах Таала ага эки периште жөнөтүп: «Барып, кулум жардамчыларына эмне деп жатканын көрүп келгиле!» – деп буйрук кылат. Эгер ал пенде периштелер келгенде, Аллага шүгүр келтирип жаткан болсо, алар бул шүгүрдү бардык нерсени эң жакшы билүүчү Аллах Таалага жеткиришет (Периштелерин бир гана пендесинин кылган жарамдуу (салих) амалдарына күбө болушсун деп жиберет).Аллах Таала: «Эгерде бул кулумдун жанын ала турган болсом, анда аны бейишке киргизишим – кулумдун мендеги акысы. А эгерде ага шыпаа бере турган болсом, анда анын этин жакшыраак эт менен, канын жакшыраак кан менен алмаштырып, күнөөлөрүн кечиришим – анын мендеги акысы», – деп билдирет».',
                    style: QuestionModel.textStyle),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Бул хадисте сыртынан караганда бизге кырсыктуу болуп көрүнгөн көптөгөн окуялар бир гана кудайдын сыноосу катары кабыл алынышы керек экени жана ал кырсыктардын аркасында абдан чоң сыйлыктардын катылуу экени билдирилет. Пайгамбарыбыз (саллаллооху алайхи ва саллам) айтат: «Ким оорукчан бирөөдөн кабар алса же мусулман бир тууганына жолукса, бир периште, «Сага береке болсун! Баскан кадамың берекеге толсун! Сен бейиштеги жайынды курдуң! – деп жарыя салат». Бул сөздү уккан Анас бин Малик (разияллоху анху): «Чындыгында, оорукчанды кабар алганы барган киши Алланын ырайымына бөлөнүп, ал соо кишиге береке берилет экен. Ал эми оорукчангачы?» – деп сураганда Алланын элчиси: «Анын күнөөсү кечирилет», – деди (Ахмад)',
                  style: TextStyle(fontSize: 17),
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Али (разияллоху анху) риваят кылат: «Ким эртең менен мусулман бир тууганынан кабар алганы барса, ага жетимиш миң периште кечке чейин кечирим дубасын сурашат. Эгерде кечинде кабар алса, таң атканча жетимиш миң периште кечирим дубасын сурашат жана бейиштен бир бак берилет» (Тирмизи).Пайгамбарыбыз (саллаллооху алайхи ва саллам) айтат: «Эгер сен оорукчандан кабар алсаң, андан сага дуба кылып коюусун өтүн. Себеби, анын дубасы периштелердин дубасындай (кабыл болот)» (Ибну Мажа). ',
                  style: TextStyle(fontSize: 17),
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Байкап көрдүңүзбү тууганым, сиздин канчалык Аллах алдында жогору инсан экениңизди. Сизден кабар алган инсандарга канча сооп жазылып жатат, а сиздин ооруган ар бир демиңизге канчалаган кечирим сооптор жазылып жатат болду экен. Балким сиз окуп жаткан болсоңуз, бул убадалар сиздин жүзүңүзгө жылмаюу, жан дүйнөңүзгө тынчтык тартуулап жаткандыр… Бул убадалар адамзаттын куру убадаларынан эмес, Улуу Жараткандын убадасы! Ал сөзсүз ишке ашат!',
                  style: TextStyle(fontSize: 17),
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Бул дүйнөдө сиз жетпеген бакыттар, дүйнө ыракаты акырет алдында кыпынчалык да кадырга ээ эмес. Бул күндөр сиз оорусаңыз да, оорубасыңыз да көз ачып жумганча өтүп кетет. Акырет сапары ал түбөлүк бакыт же азап. Ошон үчүн эч качан капаланып кайгыга чөмүлбөңүз, Жараткандын жакшылыгынан үмүт кылып, оорунун себебин алдын алууга аракет кылып жашай бериңиз… Мен сизге дем-күч боло турган, сабырдуулук кандай болорун улуу пайгамбарлардын бири, оору сыноосунда өмүрүн өткөргөн Аюб (алейхи салам) тууралуу айтып берейин.',
                  style: TextStyle(fontSize: 17),
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Аллах таала Аюб пайгамбарга азаптуу оору берип, денесин коркунучтуу жара менен жабыркатты. Бүт денесине жара чыгып, кычышып тырмана баштады. Тырмай берип тырмактары түшөт. Акыры таш, жыгач сыяктуу катуу нерселер менен тырмана баштайт. Эттери шылынып шагыраган сөөктөрү эле калат. Акырында териси чыдатпай ооручу болот. Мунусу аз келгенсип: «Аюб бир күнөө кылса керек. Аллах Таалаң аны жазалап жатат», – дешип туугандары, коңшулары жана башка жакын достору да жанына келбес болот. Жалгыз гана аялы Рахима аны таштабайт. Ага берилгендик менен кызмат кылуусун уланта берет. Аюб пайгамбар ушундай оор абалда калса да, сабыр кылып, эч качан кудайга акаарат келтирбейт. Кайра Раббисине шүгүр келтирип мактоолорду айтат. Ошондо шайтан Аюб пайгамбар жашаган шаардын жашоочуларына күмөн салып: «Анын дарты силерге жугат, аны шаарыңардан чыгарып салгыла», – дейт. Ошондо шаар калкы Аюб пайгамбар менен Рахиманы шаардан чыгарып салышат. Рахима айым шаардын сыртында бир жерде Аюб пайгамбарга кызмат кылуусун улантат. Астына кум төшөп, башына ташты жаздык кылып жөлөйт. Аюб пайгамбар жети жыл бою оору менен алпурушат. Ал абалына эч качан нараазы болбойт. Кээ бир китептерде Аюб пайгамбар он сегиз жыл ооруган деп айтылат. Ушундай аянычтуу күндөрдүн биринде Рахима айым: «Оо, Аюб! Сен Алланын пайгамбарысың. Алладан ден соолук тилеп дуба кылчы, бул дарттан кутулат элек», – деди.',
                  style: TextStyle(fontSize: 17),
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  'Анда Аюб пайгамбар: «Канча жыл бейпил турмушта жашадык», – деп сурайт.Рахима: «Сексен жыл», – деп жооп берет.Аюб пайгамбар: «Ээ Рахима! Ооруган жылдарым бейпил турмушубуздун мөөнөтүнө жетмейин Алладан айыгууну сурануудан уяламын. Алла бизге жакшылыктарды ыроологон кезде шүгүр кылып, ал эми бир балээ берген кезде сабыр кылбай коё аламбы? Мен Раббимен ыраазымын», – деп жооп берет.',
                  style: TextStyle(fontSize: 17),
                ),
                const SizedBox(
                  height: 15,
                ),
                Text(
                  '   Күн өткөн сайын Аюб пайгамбардын дарты оорлой баштайт. Рахима айым да аябай кыйналып, ичип-жегенге бир аз тамак-аш сатып алуу үчүн аргасыздан эң мыкты көйнөгүн сатып жиберет. Аюб пайгамбар Рахимага аябай боору ооруйт. Жаралары бүт денесине жайылат. Ибадаты оорлошо баштайт. Ошондо Жабрейил периште Аюб пайгамбарга Алла тааладан суранып: «Роббии инни массания дзурру ва анта Архамур-Рахимиин» (Оо, Раббим! Акыйкатта мага зыян жетти, Сен мээримдүүлөрдүн эң Мээримдүүсүсүң) – деп дуба кылуусун айтат. Аюб пайгамбар дуба да кылат.',
                  style: TextStyle(fontSize: 17),
                ),
                SizedBox(
                  height: 15,
                ),
                SizedBox(
                  height: 15,
                ),
                Text(
                  '    Адаттагыдай эле Рахима тамак-аш таап келүү үчүн сыртка чыгат. Ошол кезде Алла Тааладан кубанычтуу кабар келет. Жебрейил периште келип, Алла Тааладан: «Эй, Аюб! Балекет бердим, сабыр кылдың. Эми мен сага ырыскы берем», – деген кабарды алып келет. «Бутуң менен астыңдагы жерди тепкин!», – деп айтылат. Аюб пайгамбар ордунан араң козголуп бир нече кадам шилтейт. Ал оң буту менен жерди тепкен кезде ысык булак, сол буту менен тепкен жерден муздак булак атылып чыгат.Анан ага: «Мына ушул ысык суу кирине турган, ал эми бул муздак суу иче турган сууң», – деп айтылат. Ошентип ал ысык суу менен чайынганда денесиндеги бардык жаралардан айыгат. Муздак суудан ичкенде ичиндеги дарттардан кутулат. Күч-кубатка толуп жап-жаш жигитке айланып калат. Жебрейил периште бейиштен кийимдерди алып келип Аюб пайгамбарга кийгизет. Канча жылдан бери тартып келе жаткан азабы эми мынтип түш көргөндөй эле жок болуп кетет.',
                  style: TextStyle(fontSize: 17),
                ),
                SizedBox(
                  height: 15,
                ),
                Text(
                  '   Шаардан анча-мынча азык менен дары-дармек таап келген Рахима Аюбду жаткан жеринен таппай калат. Карышкыр жеп кеттиби деп санаага батып турган кезде жанына келишимдүү, жаш жигит келип «эмне издеп жатасыз», – деп сурайт. Ал: «Ушул жерде оорулуу чалым бар эле. Жер жуткансып жок. Жанатан бери издеп таба албай жатам» – дейт. Анда Аюб: «Анын кандай белгилери бар эле?» – деп сурайт. Рахима: «Жаш кезинде кудум сага окшош болчу», – деп жооп берет. Ошондо Аюб пайгамбар болгон окуяны төкпөй-чачпай айтып берет.Анда Рахима: «Эми сен жаш жигит болсоң, а мен болсо карыган кемпир болсом….» – деп көз жашын төгүп ыйлай баштайт.',
                  style: TextStyle(fontSize: 17),
                ),
                SizedBox(
                  height: 15,
                ),
                Text(
                  '   Аюб пайгамбар аны колунан жетелеп жылуу суу менен чайындырып, муздак суудан ичиргенде Рахима да жашарып, ай чырайы жүзүнө чыга келет. Анын колунан алынган бардык мал-мүлкү кайра берилет. Жараткан аларга көп бала-чака тартуулайт. Андан жүз бурган бардык замандаштары кечирим сурап кайра келишет. Аюб пайгамбар оорусунан айыгып, эрте менен турган кезинде өзүнчө күңгүрөнүп ыйлай баштайт. Себебин сурашканда: «Ар күнү таңга маал: «Эй, дартка чалдыккан пендем, кандайсың?» – деген үн чыгат эле, эми ал үндү уга албай калдым. Ошол үчүн ыйлап жатам», – деп жооп берет. Өмүрүнүн аягында өтө жакшы тарбияланган тун уулу Хавмелди камкорчу кылып дайындайт. Ошентип Аюб пайгамбар жүз кырк жашка чыгып көз жумат (Ага Алла Тааланын саламы болсун). ',
                  style: TextStyle(fontSize: 17),
                ),
                SizedBox(
                  height: 15,
                ),
                Text(
                  '   Эми сезгендирсиз, биздин оорулар Аюб пайгамбардын оорусунун алдында алда канча жеңил экенин. Биздин денебизди ушундай жара бассынчы, шүгүр кылмак турсун өлүп калсам деп жол издейбиз, өлүп эле тынч жатчудай. Аюб пайгамбар айыкканына сүйүнбөй, тескерисинче эмне үчүн ыйлады деп ойлойсуз? Анткени Жараткандын ырайымынан кур калдым деп кайгырды. Бирок ал пайгамбар эле. Сыноолордун эң оору пайгамбарларга берилет. Андан кийин момундарга Аллахтын эң сүйүктүү пенделерине. Демек биз Жараткандын эң жакын, дайым биз менен экенин сезип, шүгүр келтирип жашообуз керек… Жараткандын убадасында оорукчанга бул сыноо бейишке ачыктан-ачык жолдомо, бул мүмкүнчүлүктү бакыт деп билсек туура болмок. Бирок биз, пенделердин ыйманы алсыз болуп кейип жиберебиз…Аллахым ооруган жандарга шыфасын, бекем ыйман, сабырдуулук берсин деп дайыма дуба кылабыз… ',
                  style: TextStyle(fontSize: 17),
                ),
                SizedBox(
                  height: 15,
                ),
                Text(
                  '   Бул дүйнөдө адам баласынын үч дүйнөлүк байлыгы бар. Алар – мал-мүлк, урпак жана ден соолук. Бул үчөө менен пенделер сыналышат. Аюб пайгамбардын окуясы ушундай сыноого учурагандарга сабырдуулуктун үлгүсү болуп саналат. Бул окуяда Аюб пайгамбардын жара каптаган оорусу сырткы денесине жайылган эле. Ал эми бизде болсо, ички жан-дүйнөбүздү каптаган руханий ооруларыбыз бар. Ичибизди сыртка, сыртыбызды ичине карай оодара турган болсок, Аюб пайгамбардын жараларынан алда канча жаралуу жана оорулуу болуп көрүнмөкпүз. Анткени, биз жасап жаткан ар бир күнөө, башыбызга келген ар бир шек-күмөндөр жүрөгүбүзгө жана рухубузга жараттарды пайда кылып жатат. Аюб пайгамбардын жаралары анын кыска болгон бу дүйнөлүк өмүрүнө коркунуч туудурган эле. Ал эми биздин руханий жараларыбыз болсо өтө узун болгон түбөлүктүү өмүрүбүзгө коркунуч туудурууда. Андай болсо биз Аюб пайгамбардын кылган дубасына ага караганда миң эсе көбүрөөк муктажбыз. Ал эмне деп дуба кылды эле?',
                  style: TextStyle(fontSize: 17),
                ),
                SizedBox(
                  height: 15,
                ),
                Text(
                  '   Ал: «Роббии инни массания дзурру ва анта Архамур-Рахимиин» – деп дуба кылган болчу. Сабырдуулук – даанышмандыктын белгиси.Сабырдуулук – акылдын чырагы. Сабырдуулук – ыймандын күзгүсү. Караңгы туюкка кабылбайын десең төмөндөгү үч түрдүү сабырды унутпа:Биринчиси: Кулчулукта сабыр кылуу.Экинчиси: Күнөөлөргө каршы сабыр кылуу.Үчүнчүсү : Балээ-кыйынчылыктарга каршы сабыр кылуу.Акылың болсо ушул акыйкатты жүрөгүңө түйүп ал.Кайраттуулук менен: «Йа Сабур!» деп Аллага таян. Алланын сага берген сабыр, кубатын эгер жаңылыш жолдорго таратпасаң, анда ар бир түйшүккө жана ар бир кайгылуу балээлерге каршы жетиштүү болот…\n Насиба Абдуллаева \n=======================================',
                  style: TextStyle(fontSize: 17),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
