import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class TheTenthPage extends StatelessWidget {
  const TheTenthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «КАБЫЛ БОЛГОН ДУБА»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/image.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '    Бир мечитте көп жылдан бери имаммын. Канчалык ишенесиңер билбейм, бирок бул окуянын сыр бойдон калышын каалаган жокмун.Кечээ, шам намазы окулуп бүтүп, эл тарап кеткен соң, мечитте эки киши калды. Экөө эки бурчта дуба кылып отурду. Бирөө ыйлап атты, экинчиси кубанып жаткандай көрүндү. Бирок экөө тең биздин жамааттан эмес эле. Ичимден «Кой, буларды күтө турайын. Балким жардамым тийип калар» деп, чыга беришке отуруп, китеп окуй баштадым. Улам башымды көтөрүп карап коюп, тигилерди күтүп аттым. Жакшынакай кийинген киши бир маалда «Амиин» деди. Үнү кату чыккандыктан мечит жаңыра түштү. Өйдө туруп жаныма келди да «Таксырым, бул конвертти алыңыз. Балам өтө кату ооруп атты эле. Доктурлар «Бир канча күндүк өмүрү калды. Жашап кетиши кыйын, бирок дуба кылганды уланта бер» дешкен. Садака бергенди да, дуба кылганды да үзгөн жокмун. Кудайга шүгүр, азыр уулум үйдө. Апасынын кучагында. Жараткан шыпаа берип, айыгып кетти. Мен болсо эки рекет шүгүр намазын окудум, эми «уулум айыгып кетсе берейин» деп атап койгон садакам бар эле, ошону берейин дедим эле. Өзүңүз муктаж болгондорду таап, берип коёрсуз. Макулбу?» – деди. «Макул, тууганым», – дедим. Ошентип, ал чыгып кетти. Мен, «55 жаштамын, көп кишиге жардам бергенге аракет кылып келем. Бул жерде эч ким жок, эмне көйгөй бар, айт тартынбай» дедим.«Таксырым, эки уулум бар. Жакында эле бир жумушка киргем. Айлыкка чейин дагы көп убакыт бар. Ошондуктан акча жок болуп турат. Уулдарымды мектепке даярдаганга тыйын жетпей атат. Карыз сураганга да ылайыктуу киши жок. Жан дүйнөм эңшерилди. Дуба кылдым, Жараткандан жардам сурадым», – деди муңга батып. «Бир тууганым, азыр айтсам ишенбейсиң. Бирок сенден мурда чыккан киши мага конверт таштап кеткен. «Муну муктаж болгондорго берип кой», – деди эле. Дубаң кабыл болуптур, муну ал да, эки тентектин сумкасын китеп-дептерге толтур. Кубанып эле жатып калышсын» – дедим да конвертти сундум. Албай атканынан, араң көндүрдүм. Конвертте канча акча бар экенин санамак турсун, ачкан да эмесмин. Кубана түшкөн киши конвертти колуна кармаган бойдон үйүнө жөнөдү. Андан соң отуруп мындай деп шүгүр келтирдим: «Аллахым, садака бергенди да, акчага муктаж болгонду да, мечиттин имамын да бир жерден жолуктурдуң. Конвертти ачып да караган жокмун. Себеби, мен ишенип турам, Сен конверттин ичине муктажга керек болгон өлчөмдөгү акча салдырдың. Мени ушул ишке себепчи кылдың. Аллахым, сага чексиз шүгүрлөр болсун!» Чындыгында Аллахым алакан жайган пендесинин колун куру калтыргандан уялат. Биз канчалык алакан жайып сурансак, Аллахым биздин колду куру калтырбайт. Анткени Алланын казынасы кең. Жердин түбүндөгү курттун ырыскысын берип жаткан Аллахым, эч качан сизди, бизди унутуп койбойт. Канчалык кайгыга батып, же болбосо кубанычка оронуп турсак дагы Аллахыма алакан жайып, Аны аруулоону унутпайлы.\n Эрнис Уметов',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
