import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class SeventhPage extends StatelessWidget {
  const SeventhPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  '«ШАЙТАН КИМ?»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/image.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  'Мээримдүү жана ырайымдуу Алланын аты менен Шайтан оттон жаралган жаратык. Далил:Эгең периштелерге (мындай) деди: “Мен инсанды ылайдан жаратамын.Качан аны жасап бүтүп, ага өз рухумдан  (үйлөп) киргизгенимде, ага сежде кылган абалыңарда ийилгиле!”Периштелердин баары чогуу сежде кылышты,Иблистен башкасы. Ал текеберленди жана каапырлардан болду.Ал : “Эй Иблис! Мен өз колум менен жасаганга сежде кылууңдан сени эмне тосту? Сен текеберлендиңби, же улуктардан болдуңбу?” – деди.“Андан мен жакшыраакмын. Мени оттон жараттың, а аны ылайдан”, – деди .Ал  айтты: “Мындан чык! Анткени сен куулдуң…(Сад сүрөсү, 71-77)Шайтан жана шайтандын атасы Иблис периштелерден эмес, жиндерден болуп саналат. Далил:وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ أَمْرِ رَبِّهِ أَفَتَتَّخِذُونَهُ وَذُرِّيَّتَهُ أَوْلِيَاء مِن دُونِي وَهُمْ لَكُمْ عَدُوٌّ بِئْسَ لِلظَّالِمِينَ بَدَلًا[1]Ошол убакта[2] периштелерге: “ Адамга сежде кылгыла!” – деген элек.  Иблистен[3] башка бардык периштелер сежде кылышты. Ал жиндер тайпасынан эле. Эгесинин буйругунан (аткаруудан) баш тартты. Эми Менден башка⦁	[4] аны[5] жана анын урпактарын дос тутасыңарбы?!⦁	[6] Алар⦁	[7] – силерге душман!  ⦁	[8]Заалымдар үчүн кандай жаман өзгөрүш!(Кахф, 18/50)Демек, шайтандын барлыгы акыйкат. Дээрлик бардык адам шайтандын бар экенине ишенет (периштенин бар экенине ишенген сыяктуу). Шайтандын жаратылуусунда көптөгөн хикматтар бар. Алла Таала бул ааламды карама-каршылыктар менен жараткан. Иблис (шайтан) жамандыктын символу болсо, периштелер жакшылыктын символу. Шайтан адамга жамандык кылууну илхам кылса (васваса берсе), периштелер жакшылык кылууну илхам кылат.Адамдарды акыйкаттан тосуу, жаман иштерди жасатуу менен алектенген шайтан көзгө көрүнбөйт. Иблис жана анын урпактарына кыяматка чейин мөөнөт берилген. Аларда адамды туура жолдон азгыруу мүмкүнчүлүгү бар. Бирок шайтандын күчү, айла-амалы, васвасасы кубаттуу ыйманга ээ момунга жетпейт. Анткени момун шайтандын ачык душман экенин билет.Шайтандар адамды төмөнкү алты маселеде азгырат:1) Алла жана Расулуна каршы чыгуу;2) Чоң күнөөлөрдү жасоого түртүү;3) Бидааттарга түшүрүү;4) Кичинекей күнөөлөргө түртүү;5) Мубахтарга көп убакыт коротуу;6) Болбой калганда пазилети жана сообу аз болгон амалдар менен алаксытуу.[9]Алла Таала Ыйык Куранда шайтандан этият болууну эскерткен. Адам ата жана Обо энеден бери карай, адамзатка душмандык күткөн шайтан инсандын бейиштен чыгуусуна себепчи болгон. Чыныгы момун шайтанды дос күтүнбөйт.إِنَّهُ لَيْسَ لَهُ سُلْطَانٌ عَلَى الَّذِينَ آمَنُواْ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَإِنَّمَا سُلْطَانُهُ عَلَى الَّذِينَ يَتَوَلَّوْنَهُ وَالَّذِينَ هُم بِهِ مُشْرِكُونَЧындыгында, ыйман келтирип, Эгесине тобокел кылгандарга[10] шайтандын өкүмү өтпөйт.Чынында, анын өкүмү– аны дос кылып, Аллага шерик кошуучуларга гана өтөт.(Нахл, 16/99-100).Алла Таала Ыйык Куранда шайтандан кабар берип, бейиште адамзаттын ата-энесине тыюу салынган мөмөнү жедиришин, адамдын жашоосунда душмандык кыларын, акыреттеги абалын ж.б. баяндаган. Бул илахий кабарлар эскертүү болуп, шайтанга азгырылбоону насаат кылат. Шайтанга баш ийип, жашоо ыракатына берилбөөгө чакырат чексиз Мээримдүү Зат.Жыйынтыктап айтканда, периште жана жиндин бар экени кандай акыйкат болсо, шайтандын бар экендиги да ошондой акыйкат. Ал Кураний баяндар менен далилдүү. Адамзат бул ааламда кайып (гойб) ааламынын өкүлдөрү болгон периште, жин жана шайтан менен бирге жашайт. Бирок момундар шайтандын азгырынан этияттанып жашоону жакшы билет.Алла Таалам жалпыбызды туура жолдон адаштырбасын. Адашкан жолдогуларга хидаят берсин. Алла Тааладан куулган шайтандын жамандыгынан коргоону сурайм. Оомийн.\nСамидин кары Атабаев\n[1] Эй, Мухаммед!\n[2]Адам Атаны жаңы жараткан кезде\n[3]Иблис– Шайтандардын түпкү атасы. Биздин Адам Ата сыяктуу\n[4]Шайтандарды жана жалган кудайларды (айрым элдер болсо пайгамбарларды, олуяларды, баатырларды ж.б.у.с.  кудай дешкенге чейин жетишкен)…\n[5]Шайтанды\n[6]“Мен буйуруган адал иштерди кылбай, ал (шайтан) буйурган арам иштерди кыласыңарбы?!”\n[7]шайтандар\n[8]Чыныгы Кудай Алла турса, шайтандар менен достошуу бул –\n[9]Келам, 426-427\n[10]таянгандарга',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
