import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class TenthPage extends StatelessWidget {
  const TenthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «МУРАСКОРУ ЖОК БАЙЛЫК»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/image.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '    Азыркы учурда бош жаткан буюмду же мал-мүлктү табуу кыйын. Анткени адамдар отурукташкан жерлерин, колдонгон буюмдарын менчиктештирип ээлик кылууга аракеттенишет. Бирок биз байкабаган чоң байлык ээсин күтүп, кароосуз жаткандай. Бизге мурас катары калган байлык тууралуу Пайгамбарыбыз (с.а.в.): «Ким илим алуу үчүн сапарга аттанса, Аллах ага бейишке баруучу жолду жеңилдетет. Периштелер сүйгөндүктөрүнөн илим талап кылган адамдарга канаттарын жаят. Суудагы балыктардан баштап жер жана асмандагы жан-жаныбарлардын баары аалым адамдын күнөөлөрүнүн кечирилишин Аллахтан тилейт. Аалымдын аабидден (ибадат кылган адамдан) артыкчылыгы, (жарыктын жана кооздугу жагынан) Айдын башка жылдыздардан артыкчылыгындай. Акыйкатта, аалымдар – пайгамбарлардын мураскорлору. Пайгамбарлар мурас катары алтын жана күмүш ташташкан эмес. Алардын калтырган жалгыз мурасы – илим болуп эсептелет. Ошондуктан, ким аны алууга умтулса, чоң ийгиликке жетишет», – деп айткан. Илим бир жерде турбайт, ал кайсыл жерде талап пайда болсо, ошол жакты көздөй жыла берет. Эске салсак, ислам илимдери да Мекке жана Мадинадан кийин, Куфа, Басра, Багдат, Самарканд жана Андалус болуп жер которуп турган. Анткени бул тууралуу Пайгамбарыбыз (с.а.в.): «Аллах, бизден бир сөз угуп, аны (башкасына) ошондой жеткирген кишинин жүзүн жарык кылсын. Маалыматка жеткен канчалаган инсандар бар, кабар угуп (жана аны башкаларга жеткирген) кишиге караганда, алардын түшүнүү жөндөмдүүлүктөрү жогору…» – деп айткан.Буга мисал катары ислам динин алгач арабдар кабыл алып, аят-хадистерди өз учурунда угуп, аны кийинчерээк динди кабыл алган фарс жана түрк тилдүү элдерге ошондой жеткиришкен. Анын мөмөсү катары Орто Азиядан ислам динине зор салым кошкон белгилүү аалымдар пайда болду. Демек ал учурда аталган байлык өз мураскорлорун таба алган. Ал эми учурда ислам илимдери үчүн мураскор болууга аракетибиз канчалык деңгээлде жүрүп жатат? Туура, өлкөбүздөгү дин эркиндиги ибадат жана ишеним боюнча бир топ диний сабатсыздыктарды жоюуга мүмкүнчүлүк берди. Бирок ислам илимдери ал менен гана чектелбейт. Тарыхка көз чаптырып көрө турган болсок, медицинанын атасы катары Ибн Сина, химиянын атасы катары Жабир бин Хайан болсо, алгебранын атасы катары Мухаммад ибн Муса аль-Хорезми болуп жатат. Ал эми алгачкы жолу робот жасоо менен физикада Аль-Жазари, алгачкы жолу дүйнө картасын чийген Мухиддин Пири жана башка илимдерде зор салым кошкон Фараби, Беруни сыяктуу белгилүү ислам аалымдарынын китептеринин көпчүлүгү сакталбай, аз гана өлчөмдө калган болсо да, аны татыктуу улантып кете албай жатабыз. Анткени биз бул аалымдардын эмгектери тууралуу жаап жашырылгандыктанбы, айтор көп маалымат алган эмеспиз. Илим алууда ээрчүү жана изденүү бар. Эгер устат мыкты болсо, ээрчүү эң ыңгайлуусу болуп саналат. Бирок устаттарыңыз сиздин тарыхыңызды бурмалап үйрөтүп жатса, анда өз алдынча изденүүгө аракет кылууңуз керек. Ошондуктан, ислам дининде устатты тандоо маанилүү болуп саналат. Анткени жаш бутак тез ийилет демекчи, устатыңыз сизге көрсөткөн жолду туура деп эсептейсиз. Биз жогоруда аталган ислам аалымдары сыяктуу жаңыча ачылыштар жасоону элестетип кыйын көрүшүбүз мүмкүн. «Кыбыраган кыр ашат» дегендей же болбосо Ибрахим (а.с.) пайгамбардын окуясындагы суу ташыган чабалекей сыяктуу аз да болсо, өзүбүздүн күчүбүз жеткенче илим мурасына татыктуу болууга азыртадан баштап аракет кылалы. Аллахым илим жолунда жүргөндөрдүн зээнин ачып, илимдерин көбөйтө көр.\n\nАлибек Акпарали уулу   ',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
