import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class NinethPage extends StatelessWidget {
  const NinethPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «КАРАҢГЫГА СҮЙРӨГӨН КҮНӨӨДӨН САКТАНАЛЫ»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/namazubakyt.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '     Жараткан Аллах Таала пенделерин эмнеге буйруган болсо, анда адам баласынын дүйнө жана акыретине өтө чоң пайдалар бар. Аны менен биргеликте эле Жараткан тыйган күнөө иштерде чоң зыян, жоготуу, кайгы-капа жана Кыямат күнүндө жан чыдагыс азаптар бар. Айрыкча Курандын насы (тексти) менен келген күнөөлөр эң чоң күнөө болуп эсептелет. Улуу имамдардын бири Имам аз-Захабий “Кабааир” (чоң күнөлөр) деген эмгегинде бир канча күнөөлөрдү баяндайт. Алардын бири – кумар. Тагыраагы, кумар оюндарын ойноо. Бул турасында Жараткан Аллах Таала Курани Каримде мындай баяндайт:﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْأَنصَابُ وَالْأَزْلَامُ رِجْسٌ مِّنْ عَمَلِ الشَّيْطَانِ فَاجْتَنِبُوهُ     لَعَلَّكُمْ تُفْلِحُونَ ﴾ 	“Эй момундар! Арак (мас кылуучу ичимдиктерди ичүү), кумар (ойноо), (сыйынуу үчүн) жасалган таштар жана жаанын огу менен төлгө тартуу – шайтандын амалынан болгон ыплас иш. Андан сактангыла! Мүмкүн кутуларсыңар” (Маида сүрөсү 90-аят).Жогорудагы аяттан маалым болгондой, айтылып өтүлгөн иштердин баары, шайтан канчалык аны зыйнаттап жакшы көрсөтсө да, ал ыплас жана арам иш. Улуу соопторго жетүү үчүн бул иштерден узак болуу өтө маанилүү.Ушул эле аяттын улантысында:﴿ إِنَّمَا يُرِيدُ الشَّيْطَانُ أَن يُوقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ فِي الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَن ذِكْرِ اللَّهِ وَعَنِ الصَّلَاةِ ۖ فَهَلْ أَنتُم مُّنتَهُونَ ﴾ “Арак жана кумар себептүү шайтан араңарга душмандыкты, (бири-бириңерге болгон) кекти салат жана Алланы зикир кылып эстөөдөн, намаздан тосууну каалайт. Эми (жогорудагы арам иштерден) тыйыларсыңар!” (Маида сүрөсү, 91-аят).Аяттын акырында келген “Эми тыйыларсыңар!” сөзү “Эми тыйылгыла” деген маанини түшүндүрөт. Ошол себептен бул аят окулгандан кийин Азрети Умар (р.а.) “Оо Жараткан, тыйылдык” – деп айткан.Кумардын эки чоң зыяны бар.Биринчиси: адамдын дүйнө жашоосуна болгон таасири. Кумар ойногон адам “жеңилген күрөшкө тойбойт” дегендей, ар утулган сайын кайра утуп алуу үчүн бар байлыгын кумарга сарптап, кези келгенде үй-бүлөсүн да кумарга коюуга даяр болот.Экинчиси: динине тийгизген зыяны. Кумар ойногон адам утса да, утулса да кудайды эстөөнү унутат. Аллах Тааланы унуттура турган нерселердин баары арам. Себеби, арам жол менен заматта байыган соң, анын көңүлүнө, оюна уткан нерсесинен башка эч нерсенин кызыгы болбой калат. А утулган болсо, ал үчүн жер  тар болуп, өзүн жок кылуу аракетинде болот же кимдир бирөөнү тоноп, же болбосо уурдап, кайра эле көнгөн кумарын улантууга шашылат.  Мунун баары Жаратканды эстен чыгарууга себеп болот.Кумар оюндары адамдардын мал-дүйнөсүн туура эмес жолдор менен тартып алууга алып барат.  Бул турасында Куранда мындайча баяндалат:\n\n﴾ وَلَا تَأْكُلُوا أَمْوَالَكُم بَيْنَكُم بِالْبَاطِلِ … ﴿\n\n“Ортоңордогу мал-мүлк, байлыктарды өз ара арам жолдор менен жебегиле” (Бакара сүрөсү, 188-аят) Демек кумар өзү эле арам эмес, анын артынан келген байлык материалдардын баары арам. Ошол арам байлык менен чоңойгон урпагынан өзүнөн өткөн зөөкүрлөр чыкпай койбойт.\n\n (صحيح مسلم 1647) .قال رسول الله ﷺَّ: «…ومن قال لصاحبه تعال أقامرك، فليتصدَّق» [وفي رواية] فليتصدق بشيء \n  Аллахтын элчиси (с.а.в.): “…Кайсы бир киши досуна “кел, кумар ойнойбуз” десе, (айткан адам) ошол заматта садака берсин”, – деп айтты. (Муслим, 1647) Эгер “кел, кумар ойнойбуз” деп айткан сөзү үчүн гана садака бериш керек болсо, анда кумар ойногондордун абалы кандай болор экен!?Жараткан момун-мусулмандарды арам оокаттан, тура эмес түшүнүктөн жана дүйнө-акыретибизге зыян берген күнөөлөрдөн Өзү сактасын.Аaмиинь.\n\nИбрагим Ильяс уулу\n==================================== ',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
