// ignore_for_file: public_member_api_docs, sort_constructors_first
import 'package:dinbil/baaluuluktar/answer_view.dart';
import 'package:dinbil/modules/model_baaluuluk.dart';
import 'package:flutter/material.dart';
// import 'package:dinbil/service/model_baaluuluk.dart';
// import 'package:dinbil/view/answer_view.dart';

class FirstPage extends StatefulWidget {
  const FirstPage({
    Key? key,
    required this.suroo,
    required this.joop,
  }) : super(key: key);
  final String suroo;
  final String joop;

  @override
  State<FirstPage> createState() => _FirstPageState();
}

class _FirstPageState extends State<FirstPage> {
  List baaluuluktarList = [
    Baaluuluk(
        suroo: "1.	Дин  деген эмне?",
        joop:
            "Дин - бул ишеним жана ибадат кылуу маселесин түп тамырынан бери камтыган улуу жол.  Дин ар бир акыл-эстүү адамды өз каалоосуна ылайык жакшы жолдорго баштаган эреже, мыйзамдар топтому. Дин - адам баласы менен Жараткан Алла Тааланын ортосундагы байланышты жакшыртат. \n Азыркы учурда дүйнөдө жалгыз гана туура дин - Мухаммед саллАллау алейхи васаллам алып келген ислам дини. Бул диндин эч бир өкүмү бузулган эмес. Эч качан бузулбайт. Ал эми Ислам дининин ыйык китеби болгон Куран эч бир өзгөртүлбөстөн биздин доорго чейин сакталып келген жана Кыяматка чейин сакталат.  \n «Ыйман келтирип, жарамдуу амалдарды аткаргандарга келсек, алар-бейишке баруучулар, ал жайда түбөлүк калуучулар» (Бакара сүрөсү, 82-аят)"),
    Baaluuluk(
        suroo: "2.	Ислам деген эмне?",
        joop:
            "Ислам - тынчтык деген маанини билдирет жана ошондой эле Ислам - Бир гана, чыныгы Жаратканга баш ийүү деген маанини да туюнтат. Глобалдык дин болгон Ислам дини чыныгы Кудайга баш ийип жана тынчтыкта жашоо дегенди түшүндүрөт. Ошондой эле инсандын жеке өзүнүн жан дүйнөсүнүн, рухтун, сезимдердин, жүрөктүн тынчтыгына алып келет. \n Тилекке каршы Алла Тааланын бийик илимдеринен кабары жок караңгы пенделер өздөрүнүн Жараткандын алсыз кулдары экендигине карабастан аят, хадистерге тескерисинче ой жүгүртүп,  адашууга дуушар болуп келишүүдө. \n Ислам дини бүткүл ааламдык-глобалдык дин болгондуктан ал расизмди, улутчулдукту, трайбализмди, бөлүнүп-жарылууну  четке кагат.   \n 	Ислам дини-бейпилдиктин жана бакубат жашоо менен саламаттыктын дини;   \n 	Ислам дини-тазалыктын жана акыйкат менен калыстуулуктун дини;   \n 	Ислам дини-мээримдүүлүктүн жана боорукерликтин дини;  \n 	Ислам дини-адашуудан алыс болууга жана биримдүүлүккө чакыруучу дин.   \n  «Бүгүн силерге диниңерди жана (Менин) ырайымымды толук кылып, Ислам динин ыраа көрдүм. Кимде-ким күнөөгө умтулуудан эмес, ачкалыктан (жеңишке) аргасыз болсо  (күнөөгө эмес). Чындыгында Алла-Кечиримдүү, Мээримдүү» (Маида сүрөсү, 3-аят)."),
    Baaluuluk(
        suroo: "3.	Ыйман деген эмне?",
        joop:
            "Ыйман – ишенүү  дегенди билдирет. Демек “Ыйман” деген сөздүн мааниси ишенүү, аманчылыкта болуу дегенди туюнтат.  \n Ыйман - бул акылдын нуру, аң-сезимдин куту жана жүрөк туюмдарынын көркү. Убактылуу дүйнөдөн түбөлүктүү ааламга ыймандын жетеги менен гана таалайлуу болуп өтүүгө болот.  \n «Чындап ыйман келтирип, алгылыктуу иштерди жасагандар гана Жаратканга моюн сунгандар - бейиш ээлери. Алар бейиште түбөлүк болушат» (Худ сүрөсү, 23-аят). \n  Шарияттагы терминдик маанисинде ыйман - бул тил менен айтуу, жүрөк менен бекем ишенүү, дене мүчөлөрү менен амал кылуу.  \n  Ыймандын жетимиштен ашык бутагы бар. Алардын эң жогоркусу - «Лаа илааха иллаллаах» сөзүн айтуу, эң төмөнкүсү - жолдон адамдарга зыян тийгизүүчү нерселерди алып таштоо, ошондой эле  уялуу да – ыймандын бир бутагы.  \n  Ыймандын алты түркүгү бар:  \n 1)      Аллахка ыйман келтирүү;  \n 2)      Периштелерине ыйман келтирүү;  \n 3)      Китептерине ыйман келтирүү; \n 4)      Элчилерине ыйман келтирүү; \n 5)      Акырет күнүнө ыйман келтирүү;  \n 6)      Тагдырга, анын жакшылыгы менен жамандыгына ыйман келтирүү.    \n  «Жакшылык бир гана жүздөрүңөрдү чыгыш менен батышка каратууңарда эмес, бирок (нагыз)жакшылык – ким Аллахка, Акырет күнүнө, периштелерге, китепке жана пайгамбарларга ыйман келтирсе...» (Куран, Бакара 2:177)."),
    Baaluuluk(
        suroo: "4.	Ыйык Куран",
        joop:
            "Куран – бул Алла Таала тарабынан азирети Мухаммад (саллАллау алейхи васаллам) пайгамбарыбызга түшүрүлгөн ыйык Китеп. Жараткан Алла Таала ыйык Курандын алгачкы аяттарын ардактуу элчиси Мухаммадга (саллАллау алейхи васаллам) улуу көчтөн 13 жыл мурун Рамазан айынын 24-күнү кечке жуук Мекке шаарынын кыйырында жайгашкан Нур тоосунун Хира үңкүрүндө түшүрө баштаган. Алла Таала мына ушул күндөн тарта ыйык Куран китебин ар кандай шарттарда тигил же бул окуянын жүрүшүнө жараша аят-сүрө түрүндө 23 жылдын аралыгында түшүргөн. Куран мурунку ыйык китептерден айырмаланып, дароо бир жолу китеп абалында эмес, ар кайсы жагдайларга карата кээде бир аят, кээде беш, кээде он аят, кээде сүрө абалында түшүрүлгөн. Бул жагдай Алла Тааланын «Биз Куранды сен адамдарга шашпай окуп берүүң үчүн аз-аздан бөлүп түшүрдүк» (Исра сүрөсү, 106-аят) деген аятында ачык-айкын түрдө маалымдалган.   Курани Каримди окуу - мусулмандарга ибадат. Мына ушул ибадаттын, намаздын күнүмдүк турмушубуздун ажырагыс бөлүгүнө айланышынын өзү эле, анын жашообузга канчалык деңгээлде сиңип калгандыгын айгинелейт.   Улуу Курандын негизги максаты - адамзатты туура жолго жетелөө.  Ыйык Куранда көптөгөн баа жеткис сырлар жана жашоонун сырлары менен илимдин маани маңызы ачык жазылып, ааламдык прогресстин баардыгы камтылган. Акыркы илимий жетишкендиктердин арты менен он төрт кылым мурун айтылган маалыматтардын ачылышы улуу Курандын чыныгы мужиза китеп экендигинин далили."),
    Baaluuluk(
        suroo: "5.	Намаз",
        joop:
            "Намаз ислам дининде ыйман келтирүүдөн кийин фарз кылынган алгачкы буйрук. Алла Таала пенделеринин өзүнө гана ибадат кылуулары үчүн намазды фарз кылды.  Ыйык Куранда жүздөн ашуун аятта «Намаз окугула!» деп айтылат. Ал эми бир хадисте «Алла Таала күнүгө беш маал намаз окууну фарз кылды. Маани берип, шарттарына ылайык күн сайын беш маал намаз окуган адамды Жаннатка киргизерине Алла Таала сөз берди», - деп айтылат. Намаз динибизде аткарылуусу буюрулган бардык ибадаттардын эң баалуусу болуп эсептелет. Дагы бир хадисте  «Намаз окубаган адамдын исламдан насиби жок!» - деп белгиленет. Башка бир хадисте «Момун менен капырды айырмалаган өзгөчөлүк - намаз», - деп билдирилди. Башкача айтканда, мусулман (момун) намаз окуйт, каапыр окубайт. Мунафыктарр кээде окуйт, кээде окушпайт. Мунафыктар Тозокто көп азап тартышат. Расулуллах “саллАллау алейхи ва саллам” мындай дейт: «Намаз окубагандар Кыямат күнү Алла Тааланы ачуулуу көрүшөт». Намаз окуу – Алла Тааланын улуктугун ойлоп, Анын алдында өзүнүн төмөндүгүн, алсыздыгын түшүнүү. Муну түшүнүп, акыл-эси жеткен адам дайыма жакшылык жасайт. Эч качан жамандык кылбайт. Намазда аткарылуучу ар бир кыймыл-аракет рух менен денеге пайдалуу."),
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Center(child: Text('FirstPage')),
      ),
      body: ListView.builder(
        itemCount: baaluuluktarList.length,
        itemBuilder: (context, index) {
          return Card(
            child: Padding(
              padding: const EdgeInsets.all(10),
              child: ListTile(
                title: Text(
                  baaluuluktarList[index].suroo,
                  style: const TextStyle(
                    fontSize: 20,
                  ),
                ),
                leading: CircleAvatar(
                  child: Text(
                    baaluuluktarList[index].suroo[0],
                    style: const TextStyle(
                        fontSize: 15, fontWeight: FontWeight.bold),
                  ),
                ),
                trailing: IconButton(
                  onPressed: () {
                    Navigator.push(
                      context,
                      MaterialPageRoute(
                        builder: (context) => AnswerView(
                          joop: baaluuluktarList[index].joop,
                        ),
                      ),
                    );
                  },
                  icon: const Icon(Icons.arrow_circle_right_outlined),
                ),
                // Text("${baaluuluktarList[index].joop}"),
              ),
            ),
          );
        },
      ),
    );
  }
}
