import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class SixteenthPage extends StatelessWidget {
  const SixteenthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' ЭКСТРЕМИЗМ,ТЕРРОРИЗМ - БУЛ ИСЛАМ ЭМЕС»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/images.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '    Ислам дини экстремизмди жана терроризмди каралайт, айыптайт. Исламдагы жихад экстремизм жана терроризмге эч канда тийешеси жок экенин айтып келет. Тескерисинче экстремизмди жана терроризмди ар дайым каралап өтө оор кылмыштуу күнөө иштерден экенин эскертип келген. Тилеке каршы айрым адамдар өздүрүнүн тар түшүнүгү менен кылмыштуу иштерин жихад деп атап, исламдын атын жаман көрсөтүп жатышат. Ислам дини экстремизмди жана терроризмди каралайт, айыптайт. Исламдагы жихад экстремизм жана терроризмге эч канда тийешеси жок экенин айтып келет. Тескерисинче экстремизмди жана терроризмди ар дайым каралап өтө оор кылмыштуу күнөө иштерден экенин эскертип келген. Тилеке каршы айрым адамдар өздүрүнүн тар түшүнүгү менен кылмыштуу иштерин жихад деп атап, исламдын атын жаман көрсөтүп жатышат. \n\n   	Жардыруулар менен күнөөсүз адамдарды, аялдарды, балдарды, карыяларды өлтүрүп,  адамзатты кыйноого, азапка салаган ар түрдүү жолдор менен  алардын жашоосуна же эркиндигине же тынчтыгына коркунуч келтирип, аларды коркуткан иш аракеттерди жасашууда. Мунун  баардыгы тыюу салынган арам, бузуку  иштерден атаган. Мындай ишти кылган адамдар чөң күнөөкөр болушат. Алла Таала ыйык Куранда мындай деген;  \n\n «Жер бетиндеги  бузукулук кылууну көздөбө. Алла бузукуларды сүйбөйт».\n\n Алла Таала экстремистик жана террористик иштерди жана аны жасагандарды, Аллага жана анын элчисине каршы   ачык согуш жарыялагандар деп атаган. Ал эми Аллага жана анын элчисине каршы согушкандардын жазасын төмөндөгүчө баяндаган.  \n\n	«Чындыгында, Алла жана анын элчисине каршы согушкандардын, жер жүзүндө бузукулук иштерди жасап жүргөндөрдүн жазасы алар өлтүрүлөт, асылат же колу-буттары кайчылаш кесилет же мекенинен куулуп чыгарылат. Бул алардын бул дүйнөдөдөгү жазасы, ал эми Акыретте улуу азап(бар)»\n\n . Экстремистик жана террористик иштерди жасаган, жер бетинде бузукулук кылган, чектен чыккан адамдарга карата, Ислам шариятында өтө катаал жазаларды белгилеген, бул дүйнөдө бир дагы адам баласы кабыл алаган мыйзам мынчалык катаал эмес.\n\n  Бүгүнкү күнү Исламдагы эң ыйык болгон жихадды туура эмес колдонушуп, өздөрүнүн бузуку иштерин жихад деп атагандар көбөйүүдө.\n\nБелгилей кетчү бир жагдай, экстремизм жана терроризм - бул ислам эмес, ал эми жихад - бул экстремизм жана терроризм эмес.\n\n Жихаддын максаты, чындыкка жардам берүү, зордук- зомбулукту жоюу, адилеттүүлүктү, тынчтыкты жана бейпилдикти орнотуу болуп эсептелет. Исламдын ар бир ишке карата  адептери жана өкүмдөрү болгондой эле, жихадтын дагы өкүмдөрү бар. Жихад динди, ыйманды, мекенди, үй бүлөнү душмандан коргоо үчүн. Жихадда кекселерди, аялдарды, балдарды өлтүрүү арам кылынган.  Жихадда согушту таштап артка качуу арам кылынган.  Туткундарды, багынгандарды өлтүрүү же душман болсо да адамды кордоп, кулак мурдун кескилөө арам кылынган. Эгин талааларды өрттөп жок кылуу, имараттарды бузуп, талкалоого тыюу салынат.\n\n   Бүгүнкү күнүдө чектен чыккан  экстремистик жана террористик топтордун башкалардын мекенине бастырып кирип тартып алуусу, адам затынын урматын жер менен жексен кылганы динде караланган иш.',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
