import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class SixthPage extends StatelessWidget {
  const SixthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «ЖИНДЕР ААЛАМЫ»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/image.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  ' Мээримдүү жана ырайымдуу Алланын аты мененЭл арасында көп талкууланган темалардын бири жиндер ааламы болуп саналат. Ыйык Куранда жиндердин бар экендиги боюнча ачык билдирилген. Ал тургай «Жин» сүрөсү да бар. Жиндер адамдар сыяктуу эркек-ургаачыга бөлүнөт жана ичип-жешет. Төрөлүшөт жана өлүшөт. Алардын адамдардан мурда жалынсыз оттон жаратылганы Ыйык Куранда айтылат. وَلَقَدْ خَلَقْنَا الإِنسَانَ مِن صَلْصَالٍ مِّنْ حَمَإٍ مَّسْنُونٍوَالْجَآنَّ خَلَقْنَاهُ مِن قَبْلُ مِن نَّارِ السَّمُومِАкыйкатта, Биз шыгыраган кебетелүү[1] кургак чоподон инсанды жараттык. Жиндерди андан мурун түтүнсүз оттон жаратканбыз (Хижр сүрөсү, 26-27).Башка аятта:وَخَلَقَ الْجَانَّ مِن مَّارِجٍ مِّن نَّارٍЖиндерди түтүнсүз жалындан жаратты(Рахман сүрөсү, 15).Жиндер адам пендеси сыяктуу эле ибадат кылууга милдеткер (мукаллаф).وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ«Мен жин жана адамдарды өзүмө сыйынуулары үчүн гана жараттым» (Заарият сүрөсү, 56).Жиндерге да тандоо укугу берилгени белгилүү. Алардын да момундары, каапырлары, итааткөйлөрү жана тоңмоюндары бар. Алланын буйругуна баш ийбеген каапырлары тозокко түшсө, дин жолунда момун болуп жашап өткөндөрү бейишке кирет (жиндердин бейишке кирер-кирбеси боюнча ихтилаф бар). Себеби, аларга да эскертүү берилген:يَا مَعْشَرَ الْجِنِّ وَالإِنسِ أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ يَقُصُّونَ عَلَيْكُمْ آيَاتِي وَيُنذِرُونَكُمْ لِقَاء يَوْمِكُمْ هَذَا قَالُواْ شَهِدْنَا عَلَى أَنفُسِنَا وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا وَشَهِدُواْ عَلَى أَنفُسِهِمْ أَنَّهُمْ كَانُواْ كَافِرِينَ«Эй, жиндердин жана адамдардын топтору! Чын эле силерге Менин аяттарым жана мына ушул Күн тууралуу айтып эскерткен силердин өзүңөрдүн араңардан элчилер келген жок беле?» Алар: «Биз өзүбүзгө өзүбүз каршы күбөлүк беребиз», – дешет. Бул дүйнөнүн жашоосу аларды азгырып кеткен. Өздөрүнүн каапыр болгондуктары тууралуу өздөрүнө каршы күбөлүк беришет» (Анаам сүрөсү, 130).Жиндер Алла Таала жараткан алсыз жаратыктардын бири. Алланын уруксаты болмоюн адамга жакшылык да, жамандык да кыла албайт. Демек, жиндерден коркуу туура эмес. Ал эми ашкере коркуу жана ыйыктоо акыйдага (ыйманга) зыянын тийгизет.Жиндер да периштелер сыяктуу көрүнбөгөн жаратыктар (махлукат) болуп, ар кандай кейипке кубула алышат. Алар түрдүү кишинин жана айбандын көрүнүшүнө айлануу жөндөмүнө ээ. Ыйык Куранда билдирилгендей, Азирети Мухаммед (с.а.в.) жиндердин да пайгамбары – Расулу-Сакалайн.Адам баласы жиндерди көрө албайт, бирок алар адамдарды көрөт. Бул боюнча Ыйык Куранда айтылган (Арааф сүрөсү, 27). Жаралган өзгөчөлүгү жана узак жашай алышы менен инсандардан айырмаланган жиндер киши колунан келбеген иштерди кыла алат. Бирок аларды өтө кудиреттүү, өтө күчтүү, кайыптарды жана сырды билет деп ишенүү туура эмес. Ошондой эле адамга кандайдыр бир (күнөө) иштерди мажбурлап жасата албайт. Бирок адам баласы жиндерди кандайдыр бир иштерди жасата алышы мүмкүн. Буга Азирети Сулайман пайгамбардын (а.с.) жиндерди башкарганы далил боло алат.Жиндер боюнча негизсиз апыртуу, көбүртүп-жабыртуунун кереги жок. Жогоруда айтылгандай, алар Алланын уруксатысыз адам пендесине пайда да, зыян да бере албайт. Жиндердин узак жашашын жана адам колунан келбеген нерселерди жасай алышын Алла Таала жиндерди адамдардан үстүн (жогору) кылып жаратты деп ойлоо туура эмес.Эгерде жин кайсы бир адамды жактырып же өчөшүп калса, ага тийиштик (тасаллут) кылышы ыктымал. Ошол эле учурда кудай жиндерге уруксат берип, адамдарды кордотот деп да түшүнбөө керек. Жиндер адамга тийишкен фактылар өтө сейрек кездешет. Жиндердин даарышынан оолак болуу үчүн таза жүрүү керек. Ибадаттарды аксатпай, Алла Таалага дайыма жалбарып, шайтандын адамдар жана жиндерден турган армиясынан коргоону суроо керек.Жыйынтык катары айта турган болсок, жин айрым учурларда адамга тасаллут (дааруу, уруу, тийиштик) кылышы мүмкүн. Адамга жин киреби деген маселеге келсек, наста (Куран жана сүннөт) «кирет» деп так айтылган эмес. Айрым ханафи аалымдары кирет дешкен. Жиндер да адамдар сыяктуу алсыз жаратыктардын бири экенин эстен чыгарбашыбыз керек. Бирок жин маселесин оголе көркөмдөп, көбүртүп-жабыртып, мистикалык окуяларды токуп, адамдарды, өзгөчө жаш балдарды коркутуп-үркүтүүгө негиз жок. Ал эми жин кирбеген эле адамдарды финансылык кызыкчылык үчүн «сага жин кириптир» деп шантаж кылып, коркутуп, психологиялык жактан таасир өткөрүү – күнөө үстүнө күнөө.Алла Таалам момундарды каапыр жиндердин тасаллутунан жана шайтандын жамандыгынан коргосун. Оомийн!Самидин кары Атабаев, ',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
