import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class EighteenthPage extends StatelessWidget {
  const EighteenthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «КААБА, БАЙТУЛЛААХ, КЫБЛА»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/images.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '   Жогоркудай аталуулар менен бизге маалым болгон ыйык үй жөнүндө азыноолак кеп кылууну эп көрдүк. Кыбылабыз жөнүндө бир нерселерди билип койгонубуз жаман болбойт го деп ойлодум. Аллаах таалаа:\n\n إن اول بيت وضع للناس للذى ببكة مباركا و هدا للعالمين ○ فيه آيات بينات مقام إبراهيم و من دخله كان آمنا و لله على الناس حج البيت من استطاع إليه سبيلا و من كفر فإن الله غنى عن العالمين ○ { آل عمران. ٩٦ . ٩٧ .} \n\nАдамдарга мубаарак (берекеттүү), бүт ааламга хидаят болуп, алгач курулган үй, Баккадагы үй. Анда көптөгөн ачык белгилер жана макоому Ибрахим бар. Ким ага кирсе аманда болот. Ага баруу жолуна мүмкүнчүлүк тапкан адамдарга Байтты хаж кылуу фарз. Ким (фарз экенине) ишенбесе, анда Аллаах бүт ааламдан кажетсиз (бүт аалам фарз экенине ишенбесе да Аллаах алардын ишенүүсүнө муктаж эмес). { Аали Имран. 96. 97.} Деп айтып, Каабанын бир канча артыкчылыктарын баяндап кетти. Берекеттүү дегени -- аны барып таваф кылгандарга өтө көп сооп берилет, жана бүт күнөөлөрүнөн арылат. Анда көптөгөн ачык белгилер бар дегени -- анын үстүнөн канаттуу учуп өтпөйт, анын айланасында канаттуулардын жырткычы да башкасы да аралаш учуп жүрө беришет, жана макоому Ибрахим да таң калычтуу алааматтардан бири. Аны бузамын же талкалаймын деген адамга Аллаах өзү каар кылып, жана аны өзү сактайт, буга пил аскерлеринин окуясы далил. Ага кирген аманда болот дегени - харам чек арасынан сыртта кылмыш кылып, анан харамга качып кирип кетсе, ал адамга кылмышына жараша аткарылчу жаза харам ичинде аткарылбайт. Ошондуктан Абу Ханифа р.а: "Кимде ким харам чек арасынан сыртта кисас же муртад (динден кайтуу), зина себебинен өлүмгө өкүм болуп, соң харамга кирип кетсе, харам ичинде өлүм өкүмү ага жүргүзүлбөйт. Бирок ага баш паанек болгудай жай, тамак аш, суусундук берилбейт, аны менен соода сатык да кылынбайт, ал музтар болуп өзү харам чек арасынан чыгып жазага моюн сунуп берсин үчүн. Ал эми жогоркудай кылмыштарды харам чек арасынын ичинде жасаган болсо анда ага карата жаза жүргүзүлө берет, себеби Аллаах таалаа Куранда төмөнкүдөй айткан: \n\nو لا تقاتلوهم عند المسجد الحرام حتى يقاتلوكم فيه فإن قاتلوكم فاقتلوهم. {البقرة. ١٩١ } \n\nСилерге каршы урушмайынча алар менен Харам Мечитинде урушпагыла. Эгерде силерге каршы урушса анда силер да аларга каршы урушкула. {Бакара. 191.}" деп айткан. Демек Каабанын ушундай жана башка артыкчылыктары бар. Намаз окусак ошол жакка жүздөнүп окуйбуз, жана мал союууда да ошол жакка жүздөнтөбүз, жадагалса маркумдарыбызды мүрзөгө коёрдо да ошол жакка жүздөнтүп коёбуз. Хаж кылчу болсок ошол жакка барабыз . \n  Кадырбердиев Абибилла ',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
