import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class EighthPage extends StatelessWidget {
  const EighthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «АЧ КӨЗГӨ ДҮЙНӨНҮ БЕРСЕҢИЗ ДА ТОЙБОЙТ»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/namazubakyt.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '    Колуңузда барына шүгүр кылсаңыз көбөйөт. Ачкөз болсоңуз, баарын жоготосуз. Анткени адамдын бактысына ач көздүгү тоскоолдук кылат. «Байлык, бийлик бир тыйын, бакыт табуу эң кыйын» демекчи, байлык сиз үчүн кызмат кылбастан, сиз байлыктын артынан кууп жүрүп, ден-соолукту, жакын досторуңузду жана туугандарды жоготууңуз мүмкүн. Ошондой эле эң негизгиси адамгерчилик сыпатты жоготуу коркунучу бар. Ачкөз адамдар тууралуу Пайгамбарыбыз (с.а.в.): «Адам баласы эки өрөөн жык жайнаган малы болсо, дагы бир үчүнчү өрөөндү самайт. \nАдам баласынын курсагын топурак гана тойгузат. Аллах тообо кылган адамдын тообосун кабыл кылат», – деп айткан.\nДемек, ач көзгө дүйнөнү берсеңиз да тойбойт. Айрыкча азыркы учурда өлкөбүздөгү ижарага батир берүүчүлөр беш манжасын оозуна тыгып алып, күн сайын ижара акысын себепсиз көтөрүп, башка мусулман бир туугандарына зулумдук кылып жатат. \n    Кыштын суук күндөрүндө башка айласы жок жашап жаткандар ич-ичинен нааразылыгын билдирсе, ал акчанын берекеси болбойт. Берекеси жок миң сомуңуз бир сомдой эле иштелип кетет. Эң өкүнүчтүүсү, бир мусулмандын көңүлүн оорутуу болуп жатат. Бул тууралуу Пайгамбарыбыз (с.а.в.): «Бул дүйнөнүн мал дүйнөсү көздүн жоосун алат, таттуу болот. Ким бул байлыкка ачкөздүк кылбастан, көңүл байлыгы менен ээ чыкса, анда байлыгы өзү үчүн берекелүү болот. Бирок, ким жүрөгүндө сараңдык жана ачкөздүгү менен байлыкты кааласа, жеп тойбогон киши сыңары ал кишинин байлыгынын берекеси качат. Берген кол алган колдон өйдө», – деп айткан.\n     «Аз болсо да адал болсун» демекчи, коомдо ынсаптуу болуп, өзүн гана эмес, өзгөлөрдү да ойлогон адамгерчиликтүү адамдар көбүрөөк болсо экен. Пайгамбарыбыз (с.а.в.): «Чыныгы байлык мал-мүлктүн көптүгүндө эмес, көңүлдүн токтугунда» – деп айткан.Кепиндин чөнтөгү жок экенин унутуп калган окшойбуз же эч эле өлбөчүдөй жүрөбүз. Айтор, «байлык – колдун кири» дегендей, өлгөндөн кийин аны өзүңүз менен кошо алып кетүүңүз мүмкүн эмес. Бирок ага чейин алдын ала жөнөтүү мүмкүнчүлүгү боюнча Пайгамбарыбыз (с.а.в.): «Адам баласы «Байлыгым! Байлыгым!» – дейт. Эй адам баласы! Жеп-ичкениңден, кийип эскирткениңден жана садака берип (акыретте сообун алуу үчүн) алдын ала жибергениңден башкасы сенин байлыгыңбы?» – деп айткан.Аллахым баарыбызды сараңдык жана ач көздүктөн өзү сактаган болсун. Жүрөктөрүбүзгө тынчтыкты, бейпилдикти насип кылып, үй-бүлөлүк бакыт берсин.\nАлибек Акпарали уулу\n======================================',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
