import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class TwelfthPage extends StatelessWidget {
  const TwelfthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «НАМАЗ – БЕЙИШТИН АЧКЫЧЫ»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/namazubakyt.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '    Алла Таалам өзүнүн пенделерине 5 нерсени парз кылды:\n1. Шахадат (күбөлүк келимеси);\n2. Беш убак намаз окуу;\n 3. Зекет;\n 4. Орозо кармоо (жылына бир жолу Рамазан айында);\n 5. Хаж ибадатын аткаруу (өмүрүндө бир жолу).Бул беш парздын ичинде Алла Таала пендесине бүтүндөй эки дүйнөнүн бактылуулугун тартуу кылган. Ар биринде Алла Тааланын жакшылыгы, нээматы бар.Ушулардын ичинен намазга токтоло кетсек.Намаз – бул Аллах Субхану уа Тааланын пендесине берген эң чоң белеги, ибаадаттардын эң жогорку даражадагысы. Кыяматта ыймандан кийин эле  сурак намаздан башталат. Намаз пенденин Жаратуучусу менен болгон баарлашуусу, анткени, намаздын ичинде бир канча ибадаттар бар. Мында даарат, ниет, Аллага сажда кылуу, Пайгамбарга (салаллаху алейхи уа саллам) салават айтуу, дуа, зикир камтылган. Намаз менен пенде өзүнүн Эгеси болгон Алла Таалага жакындайт, туура жолго багыт алат, ыйманын бекемдейт, жүрөгү, денеси тазарып, жан дүйнөсү тынчтык табат, Акыреттеги эң биринчи суракка даярданат. Эң негизгиси Бейиштин ачкычын алуу мүмкүнчүлүгүнө ээ болот. Бул тууралуу хадистин маанисинде төмөндөгүчө айтылат: «Бейиштин ачкычы – намаз, намаздын ачкычы – даарат» (Ахмаддын Муснады).  Намаз бул – шайтан наалатына каршы болгон эң күчтүү курал. Ким беш убак намазына бекем болуп, ар дайым чын ыклас менен окуп жүрсө, эки дүйнө бактылуулукка жетет. Намаз себептүү денебизди, жүрөгүбүздү тазалап, ой-пикирибизди, кулк-мүнөзүбүздү оңдой алабыз. Алла Таала баарыбызды беш убак намазга бекем болуп, намазыбызды тургузуп, Өзүнүн ыраазычылыгына жеткенге тауфик берсин! Абдурашид ажы Юнусов',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
