import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class FifteenthPage extends StatelessWidget {
  const FifteenthPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «ЖИХАД ДЕГЕН ЭМНЕ?»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/image.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  ' Жихад деп сөздүктө - мээнет кылуу, күрөшүүнү айтат.\n\nАл эми шариатта болсо - Ислам дини үчүн, Аллахтын келимеси бийик болуусу үчүн каапырлар менен согушууну айтат.Бирок, бардык эле жерде жихад деген сөздөн согушуу, кан төгүүнү түшүнүү туура эмес. Жихадтын да бир канча түрлөрү бар:\n\n⦁	Напси - каалоолор менен жихад кылуу, динди үйрөнүү, ага амал кылуу, динге чакыруу, диндеги кыйынчылыктарга сабыр кылуу, шайтандын азгырыктары менен күрөшүү, андан келген жаман ойлорго каршы күрөшүү.\n\n⦁	Мал-мүлк, байлыкты дин үчүн иштетүү.  Динди коргоо үчүн мусулмандарга салым кошуп жардам берүү. Диндин өнүгүп өсүүпгү үчүн байлыкты иштетүү.\n\n⦁	Тил менен элди динге чакыруу. Аллах Таала Ыйык Куранда мындай деп өкүм берген: «Каапырларга моюн сунба жана алар менен Куран аркылуу жихад кыл». Куранды чечмелөөчү аалымдар бул жердеги жихад согушуу, кан төгүү деген эмес. Балким, аларга Курандагы жана Курандын тафсири болгон сүннөттөгү ачык айкын далилдер менен даават кылуу, аларды динге чакыруу деп чечмелешкен.Башка бир хадисте Пайгамбарыбыз (с.а.в) айткан: «Силерден кимиңер бир тыйуу салынган күүнө иштин болуп жатканын көрсө, ал биринчи колу менен токтотсун. Ага кудурети жетпесе тили менен айтып токтотсун. Ага да кудурети жетпесе аны жүрөгүнөн жаман көрүп койсун. Бирок, жүрөк менен жаман көрүп койуу ыймандын эң төмөнкү даражасы» деп баса белгилеген. Демек, динде чакыруунун, жамандыктан кайтаруунун шариаттагы эрежеси ушундай. Дароо эле согушуп кетүү эмес.\n\n⦁	Каапырлар менен жихад кылуунун дагы өзүнчө, шарттары бар: \n1) Мусулман болуу,\n2) Балагатка (бойго) жеткен болуу,\n3) Эркек болуш керек, \n4) Ден - соолугу чың,\n5) Акыл ээси ордунда,\n6) Күч кубаты да толук болуш керек, материалдык жагынан да моралдык жагынан да,\n7) Жалпыга өкмөт тараптан уруксат да болуш керек.Аял кипш жихадка чыкканга болбойт. Жихад бул жакта турсун алыска сапарга чьгуусун да шариат туура эмес деген. Айша энебиз (р.а) Пайгамбарыбыздан (с.а.в) келип жихадка чыгууга уруксат сураганда, Пайгамбарыбыз (с.а.в): «Аял кишинин жихады бул ажылык жана умра» - деп жооп берген.\n\nЖихад дагы экиге бөлүнөт:\n\n1) Фарз айн \n2) Фарз кифая.\n\nДушман кайсы бир мамлекетти басып кирсе, анда ошол мамлекеттин жарандары үчүн динин, мамлекетин, элин коргош үчүн алар менен күрөшүү « фарз айн» -бул учурда аял күйөсүнөн, бала атасынан сурабай алар менен күрөшүүгө шариат уруксат берген.   Эгерде душман басып кирбесе, башка мамлекетйе барып жихад кылуу фарз кифая. Ошол мамлекеттегилер өздөрү каршы чыгып алар менен жихад кылышса, калган мусулмандарга жихад кьшуу милдети жүктөлбөйт.Бир жерде жихад болуп жатабы же жокпу анын өкүмүн билүүдөн жана ага фатва берүүдөн мурда эки нерсени билүү зарыл:\n\n1) Жихадтын шариаттагы өкүмдөрүн толук билиш керек\n\n2) Ошол жерде болуп жаткан согуштан толук маалымат билип кабардар болуш керек. Андан кийин ошол жерде болуп жаткан согушту Куран жана хадисте айтылган шариаттагы жихадтын өкүмүнө салыштйрып ал чындап эле жихадбы же жихад эмесби изилдеш керек. Эгерде шариаттагы жихадтын өкүмүн билбестен туруп жихад деп жарыя кылса ал да адашат. Ошол жердеги согуштан толук маалыматы болбой туруп жихад десе ал да адашат. Ушул хадистин негизинде Сириядагы мусулмандардын ниетин биз билбейбиз. Мүмкүн ал жердеги согуш өз ара саясий бир максат үчүн болуп жатат, мүмкүн топ топко бөлүнүп шия, суннит деп согушуп жатышат, мүмкүн жер, бийлик, байлык талашып согуш болуп жатат, мына ушуну билбеген себептүү Сириядагы согушту жихад деп айта албайбыз.',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
