import 'package:dinbil/model/question_model.dart';
import 'package:flutter/material.dart';

class EleventhPage extends StatelessWidget {
  const EleventhPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.only(left: 20, top: 15, right: 10),
            child: Column(
              children: [
                const Text(
                  ' «КЫЙЫНЧЫЛЫККА САБЫР КЫЛУУ»',
                  textAlign: TextAlign.center,
                  style: QuestionModel.firttext,
                ),
                const SizedBox(
                  height: 15,
                ),
                Image.asset(
                  'assets/images.jpg',
                  fit: BoxFit.cover,
                ),
                const SizedBox(
                  height: 15,
                ),
                const Text(
                  '    Кыйынчылык башыбызга келгенде, анын артында жакшылыктар күтүп турат деген жакшы ниет менен чыдамкай жана аракетчил болуубуз керек. «Жакшы ниет жарым ырыс» дегендей, бул нерсе адамдын кыйынчылыктарды жеңип чыгуусуна түрткү берет. Жада калса, сыноо болуп келген кыйынчылык бир жакшылык болуп саналат. Себеби, кыйынчылыктар күчтүү адамдарды тарбиялап чыгарат. Кыйынчылыкка чыдабай өз жанын кыйгандар тууралуу Пайгамбарыбыз (с.а.в.): «Бириңер дагы башына келген кыйынчылыктан улам өлүмдү каалабасын. Эгер кескин түрдө өлүмдү кааласа, «Алла Таалам, жашоо мен үчүн пайдалуу болсо мага өмүр бер, өлүм мен үчүн пайдалуу болсо жанымды ал» деп айтсын», – деп буюрган.Пайгамбарыбыз Мухаммад (с.а.в.) Ислам динин жайылтууда көптөгөн кыйынчылыктарды баштан өткөргөндүктөн, кыйынчылыкка кабылган мусулмандардын көңүлүн көтөрүү максатында «Мусулмандар менин башыма келген кыйынчылыктарды көрүп, баштарына келген кыйынчылыктарга каршы кайраттуу болушсун» деген. Кыйынчылыктан кутулуунун жолдорун издеп, тынымсыз аракет жасоодо сөзсүз Аллага жалбарып дуба аркылуу жакшылык сурагандарга Пайгамбарыбыз (с.а.в.): «Бирөөңөрдүн башына бир кайгы келгенде, биз Аллага таандыкпыз жана ага кайтуучубуз. Аллах Таалам! Башыбызга келген азап-тозоктун сообун сенден гана күтөбүз, ушул себептен улам мага сыйлык бер, мен үчүн аны эң жакшысы менен алмаштыр», – деп насааттарын айткан. Бул сыноо дүйнөдө жакшылык жана жамандык менен сыналып, аны ийгиликтүү жыйынтыктап алуу чоң бакыт. «Кеңешип кескен бармак оорубайт» демекчи, башыбызга кыйынчылык келгенде ага сабыр кылып, улуулардын кеп-кеңешине кулак салыңыз. Анткени Пайгамбарыбыз (с.а.в.): «Эң негизги сабырдуулук, кыйынчылыкка алгач дуушар болгондо көрсөтүлүшү керек», –  деп айткан. Ошондой эле, кыйынчылык адамдын күнөөлөрүнө кепил болуусу жөнүндө Азирети Айша (р.а.) риваятында айтылган. Пайгамбарыбыз (с.а.в.): «Кирип кеткен бир тикенек болсо дагы башыбызга келген ар бир кыйынчылык, мусулмандын күнөөлөрүнө кепил болот», –  деп айткан. Ошондуктан чыныгы момун-мусулман катары башыбызга жакшылык келсе шүгүр айтып, жамандык келсе сабыр кылып, эсепсиз соопторго ээ болуп, ар түрдүү кыйынчылыктарга сынбаган эрки күчтүү, Аллага сүйкүмдүү пенделерден бололу.\nАкпарали уулу Алибек ',
                  style: QuestionModel.textStyle,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
